Revit 2024 API
PushButton.ClassName Property
The name of the class containing the implementation for the command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string ClassName { get; set; }
Visual Basic
Public Property ClassName As String
	Get
	Set
Visual C++
public:
property String^ ClassName {
	String^ get ();
	void set (String^ value);
}
Remarks
The class name which implements the interface IExternalCommand.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | Thrown when setting the value to null.
Autodesk.Revit.Exceptions.ArgumentException | Thrown when setting the value to an empty string.
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when setting the value to a ToggleButton which is not initialized with an external command.
See Also
PushButton Class
Autodesk.Revit.UI Namespace